## Plan Result (account-data-deleter-cdk-production)

[CI link](https://github.com/Pocket/pocket-monorepo/actions/runs/11603504692)


### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!


<pre><code>Plan: 9 to add, 0 to change, 1 to destroy.</code></pre>

* Create
  * aws_s3_bucket.list-import-bucket
  * aws_s3_bucket_lifecycle_configuration.list-imports-lifecycle-rule
  * aws_s3_bucket_notification.bucket_notification
  * aws_sqs_queue.batch-import-queue_redrive_sqs_queue_3338357E
  * aws_sqs_queue.batch-import-queue_sqs_queue_3058EF18
  * aws_sqs_queue.list-import-file-queue_redrive_sqs_queue_C4D15FAC
  * aws_sqs_queue.list-import-file-queue_sqs_queue_36BD7788
  * aws_sqs_queue_policy.enqueue-from-import-bucket-policy-atttachment
* Replace
  * aws_ecs_task_definition.data-deleter-app_application_ecs_service_ecs-task_243DED07



<details><summary>Change Result (Click me)</summary>

```hcl

  # data.aws_iam_policy_document.enqueue-from-import-bucket will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "enqueue-from-import-bucket" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "sqs:SendMessage",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]

          + condition {
              + test     = "ArnEquals"
              + values   = [
                  + (known after apply),
                ]
              + variable = "aws:SourceArn"
            }

          + principals {
              + identifiers = [
                  + "*",
                ]
              + type        = "*"
            }
        }
    }

  # aws_ecs_task_definition.data-deleter-app_application_ecs_service_ecs-task_243DED07 must be replaced
-/+ resource "aws_ecs_task_definition" "data-deleter-app_application_ecs_service_ecs-task_243DED07" {
      ~ arn                      = "arn:aws:ecs:us-east-1:996905175585:task-definition/AccountDataDeleter-Prod:820" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:us-east-1:996905175585:task-definition/AccountDataDeleter-Prod" -> (known after apply)
      ~ container_definitions    = jsonencode(
            [
              - {
                  - environment            = [
                      - {
                          - name  = "DATABASE_READ_PORT"
                          - value = "3306"
                        },
                      - {
                          - name  = "DATABASE_TZ"
                          - value = "US/Central"
                        },
                      - {
                          - name  = "DATABASE_WRITE_PORT"
                          - value = "3306"
                        },
                      - {
                          - name  = "EVENT_BUS_NAME"
                          - value = "PocketEventBridge-Prod-Shared-Event-Bus"
                        },
                      - {
                          - name  = "LIST_EXPORT_ARCHIVE_PREFIX"
                          - value = "archives"
                        },
                      - {
                          - name  = "LIST_EXPORT_BUCKET"
                          - value = "com.getpocket-prod.list-exports"
                        },
                      - {
                          - name  = "LIST_EXPORT_PARTS_PREFIX"
                          - value = "parts"
                        },
                      - {
                          - name  = "NODE_ENV"
                          - value = "production"
                        },
                      - {
                          - name  = "OTLP_COLLECTOR_URL"
                          - value = "https://otel-collector.readitlater.com:443"
                        },
                      - {
                          - name  = "SQS_BATCH_DELETE_QUEUE_URL"
                          - value = "https://sqs.us-east-1.amazonaws.com/996905175585/AccountDataDeleter-Prod-Sqs-Batch-Delete-Consumer-Queue"
                        },
                      - {
                          - name  = "SQS_LIST_EXPORT_QUEUE_URL"
                          - value = "https://sqs.us-east-1.amazonaws.com/996905175585/AccountDataDeleter-Prod-List-Export"
                        },
                    ]
                  - essential              = true
                  - healthCheck            = {
                      - command     = [
                          - "CMD-SHELL",
                          - "curl -f http://localhost:4015/health || exit 1",
                        ]
                      - interval    = 15
                      - retries     = 3
                      - startPeriod = 0
                      - timeout     = 5
                    }
                  - image                  = "996905175585.dkr.ecr.us-east-1.amazonaws.com/accountdatadeleter-prod-app:latest"
                  - logConfiguration       = {
                      - logDriver     = "awslogs"
                      - options       = {
                          - awslogs-group         = "/Backend/AccountDataDeleter-Prod/ecs/app"
                          - awslogs-region        = "us-east-1"
                          - awslogs-stream-prefix = "ecs"
                        }
                      - secretOptions = []
                    }
                  - mountPoints            = []
                  - name                   = "app"
                  - portMappings           = [
                      - {
                          - containerPort = 4015
                          - hostPort      = 4015
                          - protocol      = "tcp"
                        },
                    ]
                  - readonlyRootFilesystem = false
                  - secrets                = [
                      - {
                          - name      = "DATABASE_READ_HOST"
                          - valueFrom = "arn:aws:secretsmanager:us-east-1:996905175585:secret:AccountDataDeleter/Prod/READITLA_DB:read_host::"
                        },
                      - {
                          - name      = "DATABASE_READ_PASSWORD"
                          - valueFrom = "arn:aws:secretsmanager:us-east-1:996905175585:secret:AccountDataDeleter/Prod/READITLA_DB:read_password::"
                        },
                      - {
                          - name      = "DATABASE_READ_USER"
                          - valueFrom = "arn:aws:secretsmanager:us-east-1:996905175585:secret:AccountDataDeleter/Prod/READITLA_DB:read_username::"
                        },
                      - {
                          - name      = "DATABASE_WRITE_HOST"
                          - valueFrom = "arn:aws:secretsmanager:us-east-1:996905175585:secret:AccountDataDeleter/Prod/READITLA_DB:write_host::"
                        },
                      - {
                          - name      = "DATABASE_WRITE_PASSWORD"
                          - valueFrom = "arn:aws:secretsmanager:us-east-1:996905175585:secret:AccountDataDeleter/Prod/READITLA_DB:write_password::"
                        },
                      - {
                          - name      = "DATABASE_WRITE_USER"
                          - valueFrom = "arn:aws:secretsmanager:us-east-1:996905175585:secret:AccountDataDeleter/Prod/READITLA_DB:write_username::"
                        },
                      - {
                          - name      = "EXPORT_SIGNEDURL_USER_ACCESS_KEY_ID"
                          - valueFrom = "arn:aws:secretsmanager:us-east-1:996905175585:secret:AccountDataDeleter/Prod/EXPORT_USER_CREDS:accessKeyId::"
                        },
                      - {
                          - name      = "EXPORT_SIGNEDURL_USER_SECRET_KEY"
                          - valueFrom = "arn:aws:secretsmanager:us-east-1:996905175585:secret:AccountDataDeleter/Prod/EXPORT_USER_CREDS:secretAccessKey::"
                        },
                      - {
                          - name      = "SENTRY_DSN"
                          - valueFrom = "arn:aws:ssm:us-east-1:996905175585:parameter/AccountDataDeleter/Prod/SENTRY_DSN"
                        },
                      - {
                          - name      = "STRIPE_KEY"
                          - valueFrom = "arn:aws:ssm:us-east-1:996905175585:parameter/AccountDataDeleter/Prod/STRIPE_KEY"
                        },
                      - {
                          - name      = "UNLEASH_ENDPOINT"
                          - valueFrom = "arn:aws:ssm:us-east-1:996905175585:parameter/Shared/Prod/UNLEASH_ENDPOINT"
                        },
                      - {
                          - name      = "UNLEASH_KEY"
                          - valueFrom = "arn:aws:secretsmanager:us-east-1:996905175585:secret:AccountDataDeleter/Prod/UNLEASH_KEY"
                        },
                    ]
                  - systemControls         = []
                  - volumesFrom            = []
                },
            ] # forces replacement
        ) -> (known after apply) # forces replacement
      ~ id                       = "AccountDataDeleter-Prod" -> (known after apply)
      ~ revision                 = 820 -> (known after apply)
        tags                     = {
            "app_code"       = "pocket"
            "component_code" = "pocket-accountdatadeleter"
            "costCenter"     = "Pocket"
            "env_code"       = "prod"
            "environment"    = "Prod"
            "owner"          = "Pocket"
            "service"        = "AccountDataDeleter"
        }
        # (12 unchanged attributes hidden)
    }

  # aws_s3_bucket.list-import-bucket will be created
  + resource "aws_s3_bucket" "list-import-bucket" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "com.getpocket-prod.list-imports"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "app_code"       = "pocket"
          + "component_code" = "pocket-accountdatadeleter"
          + "costCenter"     = "Pocket"
          + "env_code"       = "prod"
          + "environment"    = "Prod"
          + "owner"          = "Pocket"
          + "service"        = "AccountDataDeleter"
        }
      + tags_all                    = {
          + "app_code"       = "pocket"
          + "component_code" = "pocket-accountdatadeleter"
          + "costCenter"     = "Pocket"
          + "env_code"       = "prod"
          + "environment"    = "Prod"
          + "owner"          = "Pocket"
          + "service"        = "AccountDataDeleter"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
    }

  # aws_s3_bucket_lifecycle_configuration.list-imports-lifecycle-rule will be created
  + resource "aws_s3_bucket_lifecycle_configuration" "list-imports-lifecycle-rule" {
      + bucket                                 = "com.getpocket-prod.list-imports"
      + id                                     = (known after apply)
      + transition_default_minimum_object_size = (known after apply)

      + rule {
          + id     = "list-import-file-7-days-expire"
          + status = "Enabled"

          + expiration {
              + days                         = 7
              + expired_object_delete_marker = (known after apply)
            }
        }
    }

  # aws_s3_bucket_notification.bucket_notification will be created
  + resource "aws_s3_bucket_notification" "bucket_notification" {
      + bucket      = (known after apply)
      + eventbridge = false
      + id          = (known after apply)

      + queue {
          + events    = [
              + "s3:ObjectCreated:*",
            ]
          + id        = (known after apply)
          + queue_arn = (known after apply)
        }
    }

  # aws_sqs_queue.batch-import-queue_redrive_sqs_queue_3338357E will be created
  + resource "aws_sqs_queue" "batch-import-queue_redrive_sqs_queue_3338357E" {
      + arn                               = (known after apply)
      + content_based_deduplication       = false
      + deduplication_scope               = (known after apply)
      + delay_seconds                     = 0
      + fifo_queue                        = false
      + fifo_throughput_limit             = (known after apply)
      + id                                = (known after apply)
      + kms_data_key_reuse_period_seconds = (known after apply)
      + max_message_size                  = 262144
      + message_retention_seconds         = 345600
      + name                              = "AccountDataDeleter-Prod-List-Import-Batches-Deadletter"
      + name_prefix                       = (known after apply)
      + policy                            = (known after apply)
      + receive_wait_time_seconds         = 0
      + redrive_allow_policy              = (known after apply)
      + redrive_policy                    = (known after apply)
      + sqs_managed_sse_enabled           = (known after apply)
      + tags                              = {
          + "app_code"       = "pocket"
          + "component_code" = "pocket-accountdatadeleter"
          + "costCenter"     = "Pocket"
          + "env_code"       = "prod"
          + "environment"    = "Prod"
          + "owner"          = "Pocket"
          + "service"        = "AccountDataDeleter"
        }
      + tags_all                          = {
          + "app_code"       = "pocket"
          + "component_code" = "pocket-accountdatadeleter"
          + "costCenter"     = "Pocket"
          + "env_code"       = "prod"
          + "environment"    = "Prod"
          + "owner"          = "Pocket"
          + "service"        = "AccountDataDeleter"
        }
      + url                               = (known after apply)
      + visibility_timeout_seconds        = 30
    }

  # aws_sqs_queue.batch-import-queue_sqs_queue_3058EF18 will be created
  + resource "aws_sqs_queue" "batch-import-queue_sqs_queue_3058EF18" {
      + arn                               = (known after apply)
      + content_based_deduplication       = false
      + deduplication_scope               = (known after apply)
      + delay_seconds                     = 0
      + fifo_queue                        = false
      + fifo_throughput_limit             = (known after apply)
      + id                                = (known after apply)
      + kms_data_key_reuse_period_seconds = (known after apply)
      + max_message_size                  = 262144
      + message_retention_seconds         = 1209600
      + name                              = "AccountDataDeleter-Prod-List-Import-Batches"
      + name_prefix                       = (known after apply)
      + policy                            = (known after apply)
      + receive_wait_time_seconds         = 0
      + redrive_allow_policy              = (known after apply)
      + redrive_policy                    = (known after apply)
      + sqs_managed_sse_enabled           = (known after apply)
      + tags                              = {
          + "app_code"       = "pocket"
          + "component_code" = "pocket-accountdatadeleter"
          + "costCenter"     = "Pocket"
          + "env_code"       = "prod"
          + "environment"    = "Prod"
          + "owner"          = "Pocket"
          + "service"        = "AccountDataDeleter"
        }
      + tags_all                          = {
          + "app_code"       = "pocket"
          + "component_code" = "pocket-accountdatadeleter"
          + "costCenter"     = "Pocket"
          + "env_code"       = "prod"
          + "environment"    = "Prod"
          + "owner"          = "Pocket"
          + "service"        = "AccountDataDeleter"
        }
      + url                               = (known after apply)
      + visibility_timeout_seconds        = 600
    }

  # aws_sqs_queue.list-import-file-queue_redrive_sqs_queue_C4D15FAC will be created
  + resource "aws_sqs_queue" "list-import-file-queue_redrive_sqs_queue_C4D15FAC" {
      + arn                               = (known after apply)
      + content_based_deduplication       = false
      + deduplication_scope               = (known after apply)
      + delay_seconds                     = 0
      + fifo_queue                        = false
      + fifo_throughput_limit             = (known after apply)
      + id                                = (known after apply)
      + kms_data_key_reuse_period_seconds = (known after apply)
      + max_message_size                  = 262144
      + message_retention_seconds         = 345600
      + name                              = "AccountDataDeleter-Prod-List-Import-Files-Deadletter"
      + name_prefix                       = (known after apply)
      + policy                            = (known after apply)
      + receive_wait_time_seconds         = 0
      + redrive_allow_policy              = (known after apply)
      + redrive_policy                    = (known after apply)
      + sqs_managed_sse_enabled           = (known after apply)
      + tags                              = {
          + "app_code"       = "pocket"
          + "component_code" = "pocket-accountdatadeleter"
          + "costCenter"     = "Pocket"
          + "env_code"       = "prod"
          + "environment"    = "Prod"
          + "owner"          = "Pocket"
          + "service"        = "AccountDataDeleter"
        }
      + tags_all                          = {
          + "app_code"       = "pocket"
          + "component_code" = "pocket-accountdatadeleter"
          + "costCenter"     = "Pocket"
          + "env_code"       = "prod"
          + "environment"    = "Prod"
          + "owner"          = "Pocket"
          + "service"        = "AccountDataDeleter"
        }
      + url                               = (known after apply)
      + visibility_timeout_seconds        = 30
    }

  # aws_sqs_queue.list-import-file-queue_sqs_queue_36BD7788 will be created
  + resource "aws_sqs_queue" "list-import-file-queue_sqs_queue_36BD7788" {
      + arn                               = (known after apply)
      + content_based_deduplication       = false
      + deduplication_scope               = (known after apply)
      + delay_seconds                     = 0
      + fifo_queue                        = false
      + fifo_throughput_limit             = (known after apply)
      + id                                = (known after apply)
      + kms_data_key_reuse_period_seconds = (known after apply)
      + max_message_size                  = 262144
      + message_retention_seconds         = 1209600
      + name                              = "AccountDataDeleter-Prod-List-Import-Files"
      + name_prefix                       = (known after apply)
      + policy                            = (known after apply)
      + receive_wait_time_seconds         = 0
      + redrive_allow_policy              = (known after apply)
      + redrive_policy                    = (known after apply)
      + sqs_managed_sse_enabled           = (known after apply)
      + tags                              = {
          + "app_code"       = "pocket"
          + "component_code" = "pocket-accountdatadeleter"
          + "costCenter"     = "Pocket"
          + "env_code"       = "prod"
          + "environment"    = "Prod"
          + "owner"          = "Pocket"
          + "service"        = "AccountDataDeleter"
        }
      + tags_all                          = {
          + "app_code"       = "pocket"
          + "component_code" = "pocket-accountdatadeleter"
          + "costCenter"     = "Pocket"
          + "env_code"       = "prod"
          + "environment"    = "Prod"
          + "owner"          = "Pocket"
          + "service"        = "AccountDataDeleter"
        }
      + url                               = (known after apply)
      + visibility_timeout_seconds        = 1800
    }

  # aws_sqs_queue_policy.enqueue-from-import-bucket-policy-atttachment will be created
  + resource "aws_sqs_queue_policy" "enqueue-from-import-bucket-policy-atttachment" {
      + id        = (known after apply)
      + policy    = (known after apply)
      + queue_url = (known after apply)
    }

Plan: 9 to add, 0 to change, 1 to destroy.

Changes to Outputs:
  ~ ecs-task-arn                                                                              = "arn:aws:ecs:us-east-1:996905175585:task-definition/AccountDataDeleter-Prod:820" -> (known after apply)
```

</details>









<!-- github-comment: {"Command":"plan","JobName":"plan","PRNumber":903,"Program":"tfcmt","SHA1":"9f1608855ec2672965ab6ee9d4dab3b28d6f0e6d","Target":"account-data-deleter-cdk-production","Vars":{},"WorkflowName":"Account Data Deleter"} -->